## 원소선택
- [행, 열] 형식의 2차원 좌표를 이용하여 원소를 지정할 수 있다
- df.loc[행인덱스, 열이름]
- df.iloc[행번호, 열번호]

In [2]:
import numpy as np
import pandas as pd

exam_data = {'이름':['학생1','학생2','학생3'],'수학': [90, 80, 70], '영어': [98, 89, 95],
             '음악': [85, 95, 100], '체육': [100, 95, 95]}
df = pd.DataFrame(exam_data)
df
df.set_index('이름',inplace=True)
df

    이름  수학  영어   음악   체육
0  학생1  90  98   85  100
1  학생2  80  89   95   95
2  학생3  70  95  100   95

     수학  영어   음악   체육
이름
학생1  90  98   85  100
학생2  80  89   95   95
학생3  70  95  100   95

In [4]:
a=df.loc['학생1','음악']
a

85

In [7]:
b=df.iloc[1,1]
b

89

In [9]:
c=df.loc['학생1',['음악','체육']]
c

음악     85
체육    100
Name: 학생1, dtype: int64

In [10]:
e=df.iloc[0,[2,3]]
e

음악     85
체육    100
Name: 학생1, dtype: int64

In [11]:
f=df.loc['학생1','음악':'체육']
f

음악     85
체육    100
Name: 학생1, dtype: int64

In [12]:
a=df.loc[['학생1','학생2'],['수학','영어']]
a

     수학  영어
이름
학생1  90  98
학생2  80  89

In [13]:
b=df.iloc[[0,1],[0,1]]
b

     수학  영어
이름
학생1  90  98
학생2  80  89

In [14]:
c=df.loc['학생1':'학생2','수학':'영어']
c

     수학  영어
이름
학생1  90  98
학생2  80  89

In [15]:
d=df.iloc[0:2,:2]
d

     수학  영어
이름
학생1  90  98
학생2  80  89